{"title": "Some Migrants Sent by Trump to Guantanamo Are Being Held by Military Guards", "url": "https://www.miamiherald.com/news/nation-world/world/article300235379.html", "published_date": 1739415011, "scrape_timestamp": "2025-02-20T09:51:42.110304+00:00", "content": "EDITORS NOTE: EDS: SUBS top with PICKUP at \"But The New York...\" to update and expand; SPLITS and EXPANDS graf \"On Wednesday, a group...\"; ADDS Miami dateline; RECODES as a Page 1 refer for Friday AMs. NOTE: This article first moved Wednesday, Feb. 12, at 9:50 p.m. ET.); (ART ADV: With photo.); (With: NY-SHELTERS-FUNDING, IMMIG-SHERIFFS-COST, GITMO-IMMIG-LAWSUIT, SHELTER-FUNDING-RULING, NY-IMMIG-LAWSUIT, GITMO-IMMIG-DETAINEES\n\nMIAMI -- Dozens of Venezuelan migrants sent by the Trump administration to the U.S. military base in Guantanamo Bay, Cuba, are being guarded by troops rather than civilian immigration officers, according to people familiar with the operation.\n\nWhile the Trump administration has portrayed the detainees as legally in the custody of Immigration and Customs Enforcement, military guards and medics are handling them in practice, the people said.\n\nIn doing so, the civilian law enforcement role of immigration detention is being essentially militarized as the government embarks on a new, legally uncertain course of moving people it intends to deport from U.S. soil into incommunicado detention at an offshore prison.\n\n\"This is the first time we've seen the government send people from U.S. soil to an overseas camp, and it's been unclear exactly what role the military is playing,\" said Lee Gelernt, an American Civil Liberties Union immigrant rights lawyer. \"All of this potentially raises legal issues we've never seen before.\"\n\nSpokespeople for the Homeland Security and Defense departments have been unwilling or unable to answer detailed questions about what is happening to the migrants at the base. The Trump administration has also not released the migrants' names, although at least two have been identified by their relatives through pictures released of the first flight.\n\nBy not disclosing the migrants' identities, the government has prevented their relatives from learning where they are being held and complicated lawyers' efforts to challenge their detention.\n\nBut The New York Times has obtained the names of 53 men who are being held in Camp 6, a prison building where, until recently, the military held al-Qaida suspects. The Times has published the list.\n\nA week after the first 10 men arrived from detention in Texas, the specifics of their status remain unknown. Officials for the Defense and Homeland Security departments have said little about them other than their nationality. They've also described some as gang members, without offering evidence.\n\nOn Wednesday, Tricia McLaughlin, a homeland security spokesperson, said that the agency had sent nearly 100 people to Guantanamo Bay and that each had final deportation orders. All of them were considered to have \"committed a crime by entering the United States illegally,\" and the group included \"violent gang members and other high-threat illegal aliens,\" she said.\n\nNot all migrants in ICE detention entered the United States illegally. Some, for example, requested asylum at the border but were eventually rejected. The government did not offer evidence that all of the men taken to Guantanamo had sneaked across the border.\n\nThe government has periodically taken migrants picked up at sea to Guantanamo to be processed. But it has not previously taken people who were already detained on U.S. soil -- and therefore have constitutional rights, even if they were in the country unlawfully -- to a U.S. detention facility abroad.\n\nNonetheless, a picture of the Guantanamo operation is emerging as military guards and medics scramble to figure out how to hold dozens of migrants. Troops had previously helped handle the base's detainees in the war against terrorism, whose numbers are now down to 15 after transfers late in the Biden administration.\n\nEight people described the migrant operations at Guantanamo. All spoke on the condition of anonymity because they were discussing sensitive information about ongoing security operations in a military zone.\n\nOne person familiar with the operation said that Camp 6 is in disrepair, with broken showers and doors and other faulty equipment that make parts of it unusable. This person also said that only two ICE officials were working inside Camp 6.\n\nThe Trump administration has told congressional staff members that only six ICE officials are working on the migrant detention operation, according to multiple people familiar with a briefing.\n\nThe congressional staff members were told that the prison building has 176 cells but capacity for only 144 men. It was not clear if that meant 144 cells are in working condition or if this was a reference to consideration of holding two men in each of 72 cells, using cots.\n\nTwo people with knowledge of prison operations said the detainees are being fed prepackaged military rations known as MREs, or Meals Ready to Eat.\n\nThe criterion for transfer to Guantanamo is currently Venezuelans in ICE custody, the congressional staffers were told. People in that category have been difficult to deport in recent years because of a breakdown in diplomatic relations, although Venezuela sent two flights to pick up some of its citizens who were being deported this week.\n\nAs of Tuesday, ICE had sent a total of 98 men to Guantanamo, according to several people keeping track of flights from El Paso, Texas, to the Navy base in southeast Cuba. Of those, 53 were being held in Camp 6 and being guarded by the military.\n\nPresident Donald Trump has called the would-be deportees \"criminal aliens,\" and administration officials have portrayed them as associates of the Tren de Aragua gang. But officials have not said what that accusation is based on for each man, and the Times could not independently verify the claims.\n\nAs of Tuesday, the other 45 migrants were being held in a lower-security building on the other side of the base. Their guards are members of the Coast Guard, which is part of the Department of Homeland Security, McLaughlin said. The names of these migrants were not on the list obtained by the Times.\n\nThe U.S. Southern Command, which operates the terrorism prison, has been streaming staff and support personnel to the base since Trump's order on Jan. 29 for the military and homeland security to prepare to expand a migrant operations center at Guantanamo Bay \"for high-priority criminal aliens unlawfully present in the United States.\"\n\nIt is not known if or when the guards at Camp 6 would be replaced by or augmented with security personnel from homeland security. Meantime, the Pentagon's prison operation, which has Arabic language linguists on staff for the detainees in the war on terrorism, put out a rush announcement called a \"hot fill,\" seeking a Spanish-language interpreter in the Navy to do a 182-day stint at the prison.\n\nOn Wednesday, a group of legal aid organizations sued the Trump administration, asking that migrants who had been taken to Guantanamo Bay be given access to lawyers to see if they want legal representation to challenge their detention there. Gelernt of the ACLU is the lead counsel in that lawsuit.\n\nThe plaintiffs also included relatives of three detainees at the base who said they had lost contact with the men and were deeply worried about them.\n\nTwo of the migrants named in the suit, Luis Alberto Castillo Rivera and Tilso Ramon Gomez Lugo, were on the list of 53 who were being held in Camp 6. Their relatives said they recognized them from pictures released during the government transfer operations.\n\nThe Supreme Court has ruled that the government has lawful authority to hold al-Qaida suspects in indefinite wartime detention at Guantanamo, under a law passed by Congress that authorizes the use of military force against the perpetrators of the Sept. 11 attacks.\n\nBut it is not clear what legal authority the Trump administration has to hold people arrested in the United States at Guantanamo for immigration detention purposes.\n\n\"When detained within the United States, immigrant detainees have the right to access counsel,\" a request for a court order accompanying the lawsuit said. It added, \"The government cannot eviscerate those rights simply by creating a legal black hole on an island in Cuba.\"\n\nThis article originally appeared in The New York Times.\n\nCopyright 2024\n\nThis story was originally published February 12, 2025 at 9:50 PM.", "content_scrape_timestamp": "2025-02-20T10:04:39.972050+00:00", "id": "17fe80a6-5dc1-4e41-a7b5-eb9f56a64461", "metadata": {"relevance_check": {"is_relevant": true, "reason": "The article discusses Venezuelan migrants being held at Guantanamo Bay's Camp 6, guarded by military personnel, and the legal challenges surrounding their detention. It directly relates to the Guantanamo Bay detention facility and the treatment of detainees, including legal and human rights concerns. "}, "people": [{"name": "Donald Trump", "type": "government"}, {"name": "Lee Gelernt", "type": "lawyer"}, {"name": "Tricia McLaughlin", "type": "government"}, {"name": "Joe Biden", "type": "government"}, {"name": "Luis Alberto Castillo Rivera", "type": "detainee"}, {"name": "Tilso Ramon Gomez Lugo", "type": "detainee"}], "locations": [{"name": "Guantanamo Bay", "type": "city"}, {"name": "Cuba", "type": "country"}, {"name": "Miami", "type": "city"}, {"name": "Texas", "type": "state"}, {"name": "Venezuela", "type": "country"}, {"name": "El Paso", "type": "city"}, {"name": "Camp 6", "type": "prison_location"}], "organizations": [{"name": "U.S. military", "type": "military"}, {"name": "Immigration and Customs Enforcement", "type": "government"}, {"name": "American Civil Liberties Union", "type": "legal"}, {"name": "Homeland Security", "type": "government"}, {"name": "Defense departments", "type": "government"}, {"name": "The New York Times", "type": "media"}, {"name": "ICE", "type": "government"}, {"name": "Navy", "type": "military"}, {"name": "Coast Guard", "type": "military"}, {"name": "Department of Homeland Security", "type": "government"}, {"name": "U.S. Southern Command", "type": "military"}, {"name": "Pentagon", "type": "government"}, {"name": "al-Qaida", "type": "other"}], "events": [{"title": "Migrant Transfer to Guantanamo Bay", "description": "The Trump administration sent dozens of Venezuelan migrants to the U.S. military base in Guantanamo Bay, Cuba, where they are being guarded by troops rather than civilian immigration officers.", "event_type": "transfer", "start_date": "2025-02-12T21:50:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["transfer"]}, {"title": "Lawsuit Filed for Migrant Detainee Access to Lawyers", "description": "Legal aid organizations sued the Trump administration, seeking access to lawyers for migrants taken to Guantanamo Bay to challenge their detention.", "event_type": "legal_decision", "start_date": "2025-02-12T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["legal_challenge", "habeas_corpus"]}, {"title": "Trump Administration Expands Migrant Operations Center", "description": "Trump administration ordered the military and homeland security to prepare to expand a migrant operations center at Guantanamo Bay for high-priority criminal aliens unlawfully present in the United States.", "event_type": "policy_announcement", "start_date": "2025-01-29T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["policy_change"]}], "tags": ["detainee_transfers", "legal_proceedings", "human_rights", "facility_conditions", "policy_changes"]}, "metadata_extraction_timestamp": "2025-03-13T11:43:32.009310"}
{"title": "Did CIA Director Gina Haspel run a black site at Guantanamo?", "url": "https://www.miamiherald.com/news/nation-world/national/article223835570.html", "published_date": 1546959319, "scrape_timestamp": "2025-02-20T09:51:42.110428+00:00", "content": "This article was produced in partnership with the Pulitzer Center on Crisis Reporting.\n\nGUANTANAMO BAY NAVY BASE, Cuba — An attorney for the accused architect of the Sept. 11 attacks told a judge in a secret session last year that CIA Director Gina Haspel ran a secret agency outpost at Guantanamo, an apparent reference to a post-9/11 black site, according to a recently declassified transcript.\n\nThe claim by Rita Radostitz, a lawyer for Khalid Sheik Mohammed, appears in one paragraph of a partially redacted transcript of a secret hearing held at Guantanamo on Nov. 16. Defense lawyers were arguing, in a motion that ultimately failed, that Haspel’s role at the prison precludes the possibility of a fair trial for the men accused of orchestrating the 9/11 attacks who were also held for years in covert CIA prisons.\n\nNeither the public nor the accused was allowed to attend the hearing but, following an intelligence review, the Pentagon released portions of its transcript on a war court website.\n\nHaspel reportedly ran a CIA black site in Thailand where two terror suspects were waterboarded, probably before her arrival there. The unverified statement that she had a similar assignment at the terror-detention center at the U.S. Navy base at Guantanamo Bay, Cuba, would reveal a never-before disclosed chapter of the spy chief’s clandestine career.\n\nThe CIA declined to comment on the claim.\n\nBut in the transcript of a discussion about CIA torture and restrictions on the lawyers for the alleged plotters of the Sept. 11, 2001 attacks, Radostitz notes that prosecutors claim they are “not trying to cover up the torture ... But the one thing that they’re not willing to talk about is the names of the people involved in the torture.” Then, after a large censored section, she says, “it makes it impossible for people at Guantanamo, who may have seen her when she was here as chief of base, to identify her and talk about it.”\n\nChief of base is a CIA term for the officer in charge of a secret foreign outpost. A 2014 Senate study of the CIA’s network of secret overseas prisons, called black sites, said the CIA had two such secret prisons at Guantanamo in 2003 and 2004 — apart from the Pentagon’s Guantanamo prison known as Camp Delta. While the military prison commanders’ names were disclosed, those who served as CIA chief of base were not.\n\nThe CIA sent the alleged 9/11 conspirators and other “high-value detainees” to military detention at Guantanamo in September 2006 after the captives spent three or four years in secret spy agency custody. But at least one 9/11 defendant, Ramzi bin al Shibh, was earlier held at Guantanamo, according to the public portion of the 6,200-page Senate Intelligence Committee study of the CIA’s overseas prison program, known as the torture report.\n\nIt says the agency operated two black sites there — code named Maroon and Indigo — from September 2003 to April 2004 then spirited them away for fear their captives might be entitled to attorneys.\n\nFormer CIA counterterrorism officer John Kiriakou told McClatchy that he was offered the Guantanamo chief of base position in late 2002 or early 2003 — and declined. “Nobody wanted the job,” he said. So they resorted to sending people on temporary duty assignments ranging from six weeks to nine months, he said.\n\n“If it was during one of those periods when they couldn’t find somebody to fill the billet it would’ve made sense that she would’ve been there a short period of time,” Kiriakou said, describing a Gitmo stint as essentially a ticket punch for some agents associated with the black site program. “So when I read it, although I was surprised by it, I kind of believed it.”\n\nFormer CIA analyst Gail Helt, now a professor of Security and Intelligence Studies at King University in Tennessee, said there’s been “a lot of shadiness” with the way the spy agency has spoken about Haspel’s agency career.\n\nAn official CIA timeline of Haspel’s 33-year career notes that the agency won’t disclose 30 short-term, temporary duty assignments she held over the course of her career, suggesting they were covert. “Was one of those at Guantanamo for a couple of months?,” said Helt. “I don’t have personal knowledge of that, and couldn’t discuss it if I did. But it doesn’t surprise me.”\n\nReached by McClatchy, Radostitz said that restrictions imposed on defense attorneys with access to classified information prohibit her from elaborating or commenting on what was said in a closed session.\n\nAccording to the transcript, Radostitz was arguing for dismissal of the charges, or to not make the trial death-penalty eligible, because of Haspel’s role as the top CIA official with control of top secret classifications. The trial judge, Marine Col. Keith Parrella, rejected the argument in December, weeks before the partial transcript was publicly released.\n\nIn it, Radostitz also argued that restrictions on defense attorneys asking questions about Haspel’s overseas black site service hamstrung their ability to prepare to defend Mohammed, who after three and a half years in CIA detention, including 183 rounds of waterboarding, declared that he oversaw the 9/11 attacks “from A to Z.” He is among five men charged in a death-penalty case alleging their conspired in the Sept. 11, 2001 hijackings that killed 2,976 people in New York, at the Pentagon and aboard an airliner that crashed in a Pennsylvania field.\n\nNo trial date has been set as lawyers litigate what evidence the defense teams can see. Defense lawyers have been trying to explore what happened to captives at Guantanamo in their continuing bid to argue the case is compromised by the CIA years.\n\nThe CIA held at least five captives there, the report said, including alleged USS Cole bomber Abd al Rahim al Nashiri, whose interrogation in Thailand Haspel reportedly oversaw.\n\nThe circle of officers involved in the black site program in the aftermath of 9/11 was so small Haspel could have run the Guantanamo outpost, said former career CIA officer Glenn Carle, who was sworn in on the same day as Haspel in 1985, but rejected the rendition and enhanced interrogation program as “illegal, unnecessary, and immoral.”\n\n“Could Gina have been chief of base? Certainly,” said Carle, who left the agency in 2007. “I do not know. I could not say if I did. But is it a realistic or plausible assertion to make? Yes. It seems from media descriptions that Gina was in Thailand. At least that was said. And it would not be implausible that an officer would go from place to place given a particular experience in this bizarre subset of operations.”\n\nOn why the agency would neither confirm nor deny an unclassified portion of a transcript alleging a Guantanamo chief of base posting, he said the CIA sees it this way: “The fact that a classified bit of information is in the public domain is irrelevant to us if we have not confirmed or spoken to it.”\n\nFormer FBI agent Ali Soufan said of Haspel, “I am not aware that she was down there.” Soufan, who conducted interrogations for the bureau at Guantanamo and elsewhere both before and aftermath the Sept. 11 attacks, said during his time at Gitmo the CIA’s chief of base “was a man and he was really helpful and very good. He was a great team player. We had a good relationship with him and his team.”\n\nSoufan said he does not recall seeing Haspel in Guantanamo but says it is possible that while “she was chief of base in the black site where Nashiri was, she may had visited Guantanamo.”\n\nThis story was originally published January 8, 2019 at 9:55 AM.", "content_scrape_timestamp": "2025-02-20T10:05:43.057908+00:00", "id": "fb46f019-6ead-40d1-a9db-0f6198d5e262", "metadata": {"relevance_check": {"is_relevant": true, "reason": "The article discusses Gina Haspel's alleged role at a CIA black site at Guantanamo Bay, the legal proceedings of detainees, and allegations of torture and mistreatment. It directly relates to the Guantanamo Bay detention facility and associated controversies, including the CIA's black site program and the treatment of detainees."}, "people": [{"name": "Gina Haspel", "type": "government"}, {"name": "Rita Radostitz", "type": "lawyer"}, {"name": "Khalid Sheik Mohammed", "type": "detainee"}, {"name": "Keith Parrella", "type": "military"}, {"name": "Ramzi bin al Shibh", "type": "detainee"}, {"name": "John Kiriakou", "type": "other"}, {"name": "Gail Helt", "type": "other"}, {"name": "Glenn Carle", "type": "other"}, {"name": "Ali Soufan", "type": "other"}, {"name": "Abd al Rahim al Nashiri", "type": "detainee"}], "locations": [{"name": "Guantanamo Bay Navy Base", "type": "other"}, {"name": "Cuba", "type": "country"}, {"name": "Guantanamo", "type": "city"}, {"name": "Thailand", "type": "country"}, {"name": "U.S. Navy base", "type": "other"}, {"name": "Guantanamo Bay", "type": "city"}, {"name": "Camp Delta", "type": "prison_location"}, {"name": "New York", "type": "city"}, {"name": "the Pentagon", "type": "other"}, {"name": "Pennsylvania", "type": "state"}], "organizations": [{"name": "Pulitzer Center on Crisis Reporting", "type": "other"}, {"name": "CIA", "type": "intelligence"}, {"name": "U.S. Navy", "type": "military"}, {"name": "Pentagon", "type": "government"}, {"name": "Senate Intelligence Committee", "type": "government"}, {"name": "McClatchy", "type": "media"}, {"name": "King University", "type": "other"}, {"name": "FBI", "type": "intelligence"}, {"name": "USS Cole", "type": "military"}], "events": [{"title": "Claim that Gina Haspel ran a CIA black site at Guantanamo", "description": "An attorney for Khalid Sheik Mohammed claimed in a secret hearing that CIA Director Gina Haspel ran a secret CIA outpost at Guantanamo, possibly a post-9/11 black site.", "event_type": "hearing", "start_date": "2018-11-16T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["torture", "interrogation"]}, {"title": "CIA operated black sites Maroon and Indigo at Guantanamo", "description": "The CIA reportedly operated two black sites at Guantanamo, code-named Maroon and Indigo, from September 2003 to April 2004.", "event_type": "other", "start_date": "2003-09-01T00:00:00+00:00", "end_date": "2004-04-01T00:00:00+00:00", "is_fuzzy_date": false, "tags": ["torture", "isolation"]}, {"title": "Transfer of 9/11 conspirators to Guantanamo", "description": "Alleged 9/11 conspirators were transferred to military detention at Guantanamo after being held in secret CIA custody for three to four years.", "event_type": "transfer", "start_date": "2006-09-01T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["transfer"]}, {"title": "Kiriakou offered Guantanamo chief of base position", "description": "Former CIA counterterrorism officer John Kiriakou stated he was offered the Guantanamo chief of base position in late 2002 or early 2003 but declined.", "event_type": "other", "start_date": "2002-12-01T00:00:00+00:00", "end_date": null, "is_fuzzy_date": true, "tags": ["other"]}], "tags": ["torture_allegations", "legal_proceedings", "intelligence_gathering", "detainee_treatment"]}, "metadata_extraction_timestamp": "2025-03-13T11:43:41.984693"}
{"title": "Sept. 11 defense lawyers threaten hearing boycott over FBI interview of paralegal", "url": "https://www.miamiherald.com/news/nation-world/world/americas/guantanamo/article224957515.html", "published_date": 1548708075, "scrape_timestamp": "2025-02-20T09:51:42.110412+00:00", "content": "This article was produced in partnership with the Pulitzer Center on Crisis Reporting.\n\nGUANTANAMO BAY NAVY BASE, Cuba — The attorney for Khalid Sheik Mohammed, the alleged architect of the 9/11 plot, on Monday threatened to refuse to participate in this week’s pretrial hearing, saying he was disturbed by the FBI questioning a former 9/11 defense team paralegal at an Army base in Texas.\n\nDefense attorney David Nevin said the questioning by federal agents raised a new challenge to attorney-client confidentiality in the terrorism trial.\n\nDefense lawyers have repeatedly claimed that intelligence agencies were interfering in their independent relationships with their clients. They’ve found listening devices that looked like smoke detectors in their meeting rooms, which the original case judge had removed; a remote court audio kill switch, which the judge ordered unplugged; and the FBI recruiting defense team informants, which the judge ordered investigated.\n\nThe new judge in the case, Marine Col. Keith Parrella, sought to reassure defense lawyers that none of them were under federal investigation. But the paralegal said in court documents that intelligence agents pointedly asked about defense team dynamics in three days of questioning at Fort Hood, Texas last month.\n\n“The agents wanted to know all sorts of information about the work of the defense team, the personalities of the team members, the communications,” the paralegal, Army Staff Sgt. Brent Skeete, wrote in a sworn affidavit filed in federal court. They sought “my opinions of everyone, and lots of other privileged information.”\n\nIt is not clear why the FBI is interested in Skeete.\n\n“We have no comment in keeping with our usual practice of neither confirming nor denying specific investigations,” FBI spokeswoman Carol Cratty said.\n\nAt the time, Skeete worked for lawyers defending Walid bin Attash, who with Mohammed and three other former CIA captives are accused of training, organizing or helping with travel arrangements and funding the 19 hijackers who crashed passenger airlines into New York’s World Trade Center, a Pennsylvania field and at the Pentagon on Sept. 11, 2001, killing 2,976 people. The five could be executed if they are convicted.\n\nThe accused 9/11 conspirators were interrogated and held for three and four years in secret CIA prisons before President George W. Bush sent them to Guantanamo in 2006, giving the CIA and FBI key classification roles in their cases.\n\nNevin said this episode appeared to be the latest in rolling intelligence agency investigations of himself and his team since 2009 that have never yielded charges against him but appeared to be part of an unending “effort to intimidate the defense teams. I’d be a little bit off my rocker to think otherwise.”\n\nSkeete, who converted to Islam while in the Army, was in Texas visiting family, and preparing for a new Army paralegal assignment in South Korea when he was called in for questioning — first by military intelligence, and then by FBI agents.\n\nLast week in Washington, Parrella met with special Justice Department 9/11 case lawyers to hear about the Skeete interview and ruled that current, active 9/11 defense team members are not under federal investigation, and should proceed at this week’s hearing.\n\nDefense lawyers, who have top secret clearances, bristled at the judge’s decision to exclude them from that meeting and rule without hearing from them.\n\nMohammed’s attorneys are separately asking a federal court to remove Parrella from the case because he has worked at the National Security Division of the Department of Justice, which has furnished prosecutors to this 9/11 case.\n\nMonday, Nevin said that without more information about the FBI’s national security investigation of the sergeant, which he said began in November, he and the other lawyers defending Mohammed have a duty not to participate in court litigation. Bin Attash defense attorney Cheryl Bormann has also said, in court filings, that she’s laboring under a conflict and cannot litigate anything else in the case until she know more about the Skeete investigation.\n\nParrella last week ordered Justice Department lawyers to provide defense attorneys with written declarations that say they are not under investigation. A Justice Department lawyer, Jocelyn Ballantine, said the documents might be ready Feb. 1.\n\nThis story was originally published January 28, 2019 at 3:41 PM.", "content_scrape_timestamp": "2025-02-20T10:05:28.984103+00:00", "id": "05057ae5-e727-4813-976b-1992cc57e4fa", "metadata": {"relevance_check": {"is_relevant": true, "reason": "The article discusses legal proceedings, attorney-client privilege concerns, and FBI investigations related to the 9/11 trial at Guantanamo Bay, including specific detainees like Khalid Sheik Mohammed and Walid bin Attash. It also mentions allegations of intelligence agency interference and the history of the detainees' interrogations and detention at Guantanamo after being held in CIA prisons. "}, "people": [{"name": "Khalid Sheik Mohammed", "type": "detainee"}, {"name": "David Nevin", "type": "lawyer"}, {"name": "Keith Parrella", "type": "government"}, {"name": "Brent Skeete", "type": "military"}, {"name": "Carol Cratty", "type": "journalist"}, {"name": "Walid bin Attash", "type": "detainee"}, {"name": "George W. Bush", "type": "government"}, {"name": "Cheryl Bormann", "type": "lawyer"}, {"name": "Jocelyn Ballantine", "type": "lawyer"}], "locations": [{"name": "Cuba", "type": "country"}, {"name": "Texas", "type": "state"}, {"name": "Fort Hood", "type": "city"}, {"name": "New York", "type": "city"}, {"name": "Pennsylvania", "type": "state"}, {"name": "Washington", "type": "city"}, {"name": "South Korea", "type": "country"}, {"name": "Guantanamo Bay Navy Base", "type": "other"}, {"name": "Pentagon", "type": "other"}, {"name": "Guantanamo", "type": "city"}], "organizations": [{"name": "FBI", "type": "intelligence"}, {"name": "Army", "type": "military"}, {"name": "Navy", "type": "military"}, {"name": "CIA", "type": "intelligence"}, {"name": "US DoD", "type": "government"}, {"name": "DoJ", "type": "government"}, {"name": "Department of Justice", "type": "government"}, {"name": "National Security Division of the Department of Justice", "type": "government"}, {"name": "Pulitzer Center on Crisis Reporting", "type": "other"}], "events": [{"title": "9/11 defense lawyers threaten hearing boycott", "description": "Khalid Sheik Mohammed's attorney threatened to boycott this week's pretrial hearing due to the FBI questioning a former 9/11 defense team paralegal.", "event_type": "hearing", "start_date": "2019-01-28T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["legal_challenge", "other"]}, {"title": "FBI questioning of paralegal", "description": "FBI questioned a former 9/11 defense team paralegal, Army Staff Sgt. Brent Skeete, at Fort Hood, Texas, for three days. The agents asked about the defense team's work, personalities, communications, and sought privileged information.", "event_type": "other", "start_date": "2019-01-01T00:00:00+00:00", "end_date": null, "is_fuzzy_date": true, "tags": ["other"]}, {"title": "Intelligence agency interference claims", "description": "Defense attorney David Nevin stated that intelligence agencies have been interfering with attorney-client confidentiality since 2009.", "event_type": "other", "start_date": "2009-01-01T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["other"]}, {"title": "Motion to remove Judge Parrella", "description": "Mohammed’s attorneys are asking a federal court to remove Judge Parrella from the case because he has worked at the National Security Division of the Department of Justice.", "event_type": "legal_decision", "start_date": "2019-01-28T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["legal_challenge"]}, {"title": "Justice Department to provide declarations", "description": "Justice Department lawyers to provide defense attorneys with written declarations that say they are not under investigation.", "event_type": "other", "start_date": "2019-01-28T00:00:00+00:00", "end_date": "2019-02-01T00:00:00+00:00", "is_fuzzy_date": false, "tags": ["other"]}], "tags": ["legal_proceedings", "intelligence_gathering", "legal_representation", "military_commissions"]}, "metadata_extraction_timestamp": "2025-03-13T11:43:52.282782"}
{"title": "9/11 plea deal includes lifetime gag order on CIA torture secrets", "url": "https://www.miamiherald.com/news/nation-world/world/article299960709.html", "published_date": 1738985719, "scrape_timestamp": "2025-02-20T09:51:42.110329+00:00", "content": "Khalid Shaikh Mohammed, the prisoner at the military prison in Guantanamo Bay, Cuba, who is accused of plotting the 9/11 attacks, has agreed to never disclose secret aspects of his torture by the CIA if he is allowed to plead guilty rather than face a death-penalty trial.\n\nThe clause was included in the latest portions of his deal to be unsealed at a federal appeals court in Washington. A three-judge panel is considering whether former Defense Secretary Lloyd Austin III lawfully withdrew from a plea agreement with Mohammed in the capital case against five men who are accused of conspiring in the attacks that killed nearly 3,000.\n\nThe CIA has never taken a public position on whether it supports the deal, and the agency declined to comment Friday. But the latest disclosure makes clear that Mohammed would not be allowed to publicly identify people, places and other details from his time in the agency’s secret prisons overseas from 2003-06.\n\nIt has been publicly known for years that Mohammed was waterboarded 183 times by the CIA. It has also been revealed that waterboarding was done by a three-person interrogation team led by Bruce Jessen and James E. Mitchell, two former contract psychologists for the agency. Details of Mohammed’s violent treatment, including rectal abuse, have emerged in court filings and leaks.\n\nBut the agency has protected the names of other people who worked in the “black site” prisons, notably medical staff, guards and other intelligence agency employees who questioned Mohammed hundreds of times as he was shuttled between prisons in Afghanistan, Poland and other locations that have not been acknowledged by the CIA as former black sites.\n\nNow, a recently unredacted paragraph in Mohammed’s 20-page settlement says he agreed not to disclose “any form, in any manner, or by any means” information about his “capture, detention, confinement of himself or others” while in U.S. custody.\n\nHe signed the agreement July 31, after more than two years of negotiations between his lawyers and prosecutors, who are responsible for protecting national security secrets. Two military courts have ruled that Austin acted too late when he tried to withdraw from the settlement Aug. 2, two days after the retired Army general he put in charge of the case had signed it.\n\nThe settlement and similar agreements with two of Mohammed’s co-defendants, Walid bin Attash and Mustafa al-Hawsawi, are still mostly under seal while defense lawyers seek to enforce the agreement and hold a sentencing hearing at Guantanamo Bay.\n\nSecrecy surrounding the black site program has been one reason for long delays in starting the trial. Mohammed was first charged in this case in 2012. Defense lawyers have spent years litigating for government versions of what happened to Mohammed and the other four defendants in the case, forcing prosecutors to frequently seek permission from the military judges to withhold or redact certain evidence in the case.\n\nThe settlement does allow Mohammed to continue discussing those details with his lawyers while they prepare for a lengthy sentencing trial before a military jury. His lawyers have an independent obligation to keep that information classified.\n\nSeparately Friday, the three-judge panel of the U.S. Court of Appeals for the D.C. Circuit extended an order preventing the military judge at Guantanamo from holding plea proceedings in the case.\n\nThis article originally appeared in The New York Times.\n\nCopyright 2024\n\nThis story was originally published February 7, 2025 at 10:35 PM.", "content_scrape_timestamp": "2025-02-20T10:04:40.173746+00:00", "id": "0532a14f-a9af-4665-b955-293fe6aa874f", "metadata": {"relevance_check": {"is_relevant": true, "reason": "The article discusses Khalid Shaikh Mohammed, a prisoner at Guantanamo Bay, and his plea deal which includes a gag order on CIA torture secrets. It also mentions the military prison in Guantanamo Bay, Cuba, and legal proceedings related to Guantanamo detainees. The article also discusses allegations of torture and mistreatment at Guantanamo. "}, "people": [{"name": "Khalid Shaikh Mohammed", "type": "detainee"}, {"name": "Lloyd Austin III", "type": "government"}, {"name": "Bruce Jessen", "type": "other"}, {"name": "James E. Mitchell", "type": "other"}, {"name": "Walid bin Attash", "type": "detainee"}, {"name": "Mustafa al-Hawsawi", "type": "detainee"}], "locations": [{"name": "Guantanamo Bay", "type": "city"}, {"name": "Cuba", "type": "country"}, {"name": "Washington", "type": "city"}, {"name": "Afghanistan", "type": "country"}, {"name": "Poland", "type": "country"}], "organizations": [{"name": "CIA", "type": "intelligence"}, {"name": "Defense Secretary Lloyd Austin III", "type": "government"}, {"name": "US DoD", "type": "government"}, {"name": "Army", "type": "military"}, {"name": "Guantanamo Bay", "type": "military"}, {"name": "The New York Times", "type": "media"}, {"name": "U.S. Court of Appeals for the D.C. Circuit", "type": "legal"}], "events": [{"title": "9/11 Plea Deal Includes Gag Order on CIA Torture Secrets", "description": "Khalid Shaikh Mohammed agreed to a plea deal that includes a lifetime gag order on disclosing secret aspects of his torture by the CIA.", "event_type": "legal_decision", "start_date": "2024-07-31T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["torture", "interrogation", "policy_change", "legal_challenge"]}, {"title": "Defense Secretary Withdraws from Plea Agreement", "description": "Defense Secretary Lloyd Austin III withdrew from a plea agreement with Mohammed, which is now being considered by a three-judge panel.", "event_type": "legal_decision", "start_date": "2024-08-02T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["legal_challenge", "policy_change"]}, {"title": "Appeals Court Extends Order Preventing Plea Proceedings", "description": "The U.S. Court of Appeals extended an order preventing the military judge at Guantanamo from holding plea proceedings in the case.", "event_type": "legal_decision", "start_date": "2025-02-07T00:00:00+00:00", "end_date": null, "is_fuzzy_date": false, "tags": ["legal_challenge"]}], "tags": ["torture_allegations", "legal_proceedings", "intelligence_gathering", "detainee_treatment"]}, "metadata_extraction_timestamp": "2025-03-13T11:44:00.633125"}
{"title": "Complete guide to classical music events in South Florida", "url": "https://www.miamiherald.com/entertainment/music-news-reviews/article292191050.html", "published_date": 1726993800, "scrape_timestamp": "2025-02-20T09:51:42.110337+00:00", "content": "ALHAMBRA ORCHESTRA\n\nSept. 28-29: Hispanic Heritage Concert Celebration, featuring stellar guitar soloist Koh Kazama, flutist Carol Naveira-Nicholson and violinists Steffen Zeichner and Daniel Andai performing works by Hispanic composers including Lecuona, Rodrigo, Sarasate and Tarrega. Sanctuary.\n\nOct. 25: Spooky Symphony – A Halloween Extravaganza: 16th-annual kid-friendly concert of eerie classics and iconic movie themes, featuring the Greater Miami Youth Symphony. Moss.\n\nDec. 15: Holiday Pops. Miami-Dade College’s Vocal Fusion ensemble performs spirited jazz renditions and heartwarming orchestral arrangements. Pinecrest.\n\nFeb. 1: South Florida’s Got Talent: Presenting the young winners of the annual concerto competition, accompanied by the full Alhambra Orchestra.. FIU-Wertheim.\n\nMarch 16: From Folk to Classical: The talented members of our orchestra breathe life into a vibrant tapestry of folk-inspired works from Europe and America. CGCC.\n\nMay 3: 35th Season Finale Concert: Enjoy the fiery passion of late Romantic masterpieces, from the sweeping melodies of Tchaikovsky’s orchestral brilliance to the Bohemian charm of Dvorak’s lush works. FIU-Wertheim.\n\nJune 15: Opera Showcase: Manny Perez Studio’s top singers, accompanied by a full orchestra, perform beloved gems from Verdi to Puccini. Sanctuary.\n\nADRIENNE ARSHT CENTER FOR THE PERFORMING ARTS\n\nDec. 14: Avatar: The Last Airbender – In Concert: Live orchestral rendition of the series’ iconic soundtrack, paired with a nearly two-hour special recap of the animated series’ three seasons displayed on a full-size cinema screen. Arsht.\n\nDec. 28: Salute to Vienna New Year’s Concert: Greet the new year with the Strauss Symphony of America, featuring Gregory Vajda, conductor (Budapest); Sera Gosch, soprano (Vienna); and Brian Cheney, tenor (New York); plus international champion ballroom dancers. Arsht.\n\nJan. 16: The Chicago Symphony Orchestra, led by music director emeritus Riccardo Muti. Program: Bellini - Overture to Norma; Schubert - Symphony No. 8 in B minor, D. 759 (Unfinished); Tchaikovsky - Symphony No. 4 in F minor, Op. 36. Arsht.\n\nJan. 24-25: The Cleveland Orchestra in Miami – Beethoven’s Violin Concerto: featuring Kahchun Wong, conductor, and Sayaka Shoji, violin. Program: Beethoven - Violin Concerto and Mussorgsky - Pictures at an Exhibition. Arsht.\n\nJan. 31-Feb. 1: The Cleveland Orchestra in Miami – Dvorak’s Symphony No. 8: Featuring Stephane Deneve, conductor, and Maria Duenas, violin. Program: Bizet - Suite from L’Arlesienne, Lalo - Symphonie espagnole and Dvorak - Symphony No. 8. Arsht.\n\nMarch 2: London Symphony Orchestra: Featuring Sir Antonio Pappano, chief conductor, and Janine Jansen, violin. Program: Walker - Sinfonia No. 5, Bernstein - Serenade and Elgar - Enigma Variations. Arsht.\n\nMarch 19: Israel Philharmonic: Featuring Lahav Shani, music director. Program: Avni – Prayer, Bernstein - Halil and Tchaikovsky - Symphony No. 6. Arsht.\n\nMarch 22: National Symphony Orchestra: Featuring Gianandrea Noseda, music director, and Hilary Hahn, violin. Program: Simon - Four Black American Dances, Korngold - Violin Concerto and Beethoven - Symphony No. 5. Arsht.\n\nMay 2-3: The Cleveland Orchestra in Miami – Holst’s The Planets: Featuring Daniel Harding, conductor, and Avery Amereau, contralto. Program: Elgar - Sea Pictures and Holst - The Planets. Arsht.\n\nAVENTURA ARTS & CULTURAL CENTER\n\nOct. 20: Concerto Night: Miami International Piano Festival opens its new season with three acclaimed pianists conducted by Igor Gruppman. The program features Vyacheslav Gryasnov performing Mozart’s Concerto No. 12 in A Major, Florian Noack performing Mendelssohn’s Concerto No. 2 in D minor and Dmitry Ablogin performing Hummel’s Concerto No. 2 in A minor. Aventura.\n\nNov. 17: Miami International Piano Festival Presents: Josu De Solaun, the only Spanish pianist to win first prizes at the Jose Iturbi (2006) and George Enescu (2014) international piano competitions since their receptive inceptions in 1980 and 1958. Aventura.\n\nJan. 12: Miami International Piano Festival Presents: Russian pianist Dmitry Ablogin, who is regarded as one of the most brilliant and creative keyboard artists of his generation. Aventura.\n\nFeb. 23: Miami International Piano Festival Presents: critically acclaimed Israeli pianist Ariel Lanyi. Aventura.\n\nFeb. 28: Leland Ko, cellist: Miami Premiere Performance “Volksgeist.” Aventura.\n\nMarch 23: Miami International Piano Festival Presents: Ilya Itin, known for his extraordinary range, power, quality of sound and command of the piano. Aventura.\n\nApril 27: Miami International Piano Festival Presents: Brandon Goldberg, the youngest recipient of the ASCAP Herb Alpert Young Jazz Composer Award (2022). Aventura.\n\nMay 18: Miami International Piano Festival Presents: Belgian pianist Julien Libeer. According to Suddeutsche Zeitung, “Everything he does sounds true, with great economy of gestures, crystal-clear limpidity and intense expression.” Aventura.\n\nBARRY UNIVERSITY\n\nDec. 8: Handel’s Messiah and Holiday Pops with guest vocalists and the South Florida Symphony Chorus. Barry.\n\nBROWARD CENTER FOR THE PERFORMING ARTS\n\nOct. 6 and 8: Symphony of the Americas: Holst - The Planets, From Earth to The\n\nBeyond. BCPA.\n\nOct. 26: Disney in Concert: Tim Burton’s Nightmare Before Christmas featuring the South Florida Symphony Orchestra. BCPA.\n\nNov. 10 and 12: Symphony of the Americas: Mancini Remastered - 100 Years of Henry Mancini & Friends. BCPA.\n\nDec. 5 and 7: Florida Grand Opera: The Magic Flute. BCPA.\n\nDec. 8 and 10: Symphony of the Americas: Holiday POPS. BCPA.\n\nJan. 21: Symphony of the Americas: Hope & Triumph: Price, Montgomery, Tchaikovsky Symphony No. 4. BCPA.\n\nFeb. 13 and 15: Florida Grand Opera: The Elixir of Love. BCPA.\n\nFeb. 25: Symphony of the Americas: Copeland & Bernstein – American Journeys. BCPA.\n\nMarch 11 and 16: Symphony of the Americas: Shostakovich’s Leningrad: Courage & Resilience. BCPA.\n\nApril 20 and 22: Symphony of the Americas: Noche de Zarzuela - The Passion of Zarzuela. BCPA.\n\nApril 24 and 26: Florida Grand Opera: Carmen. BCPA.\n\nMay 11 and 13: Symphony of the Americas: Broadway Showstoppers! Broadwayʼs Leading Men. BCPA.\n\nCHOPIN FOUNDATION\n\nJan. 4-5: Preliminary Round. Newman.\n\nJan. 6-7: Quarterfinals. Newman.\n\nJan. 8-9: Semifinals. Newman.\n\nJan. 11-12: Finals. UM-Gusman.\n\nFeb. 15: Chopin for All free concert: 2nd Prize Winner National Chopin Piano Competition. AACC.\n\nFeb. 16: Chopin for All free concert: 2nd Prize Winner National Chopin Piano Competition. Granada.\n\nFeb. 23: Chopin in Key Biscayne: Pianist TBD. KBCC.\n\nMarch 8: Chopin for All free concert: 3rd Prize Winner National Chopin Piano Competition. AACC.\n\nMarch 9: Chopin for All free concert: 3rd Prize Winner National Chopin Piano Competition. Granada.\n\nMarch 23: Chopin Salon: 1st Prize Winner National Chopin Piano Competition. MBWC.\n\nApril 5: Chopin for All free concert: 4th Prize Winner National Chopin Piano Competition. AACC.\n\nApril 6: Chopin for All free concert: 4th Prize Winner National Chopin Piano Competition. Granada.\n\nApril 27: Chopin Salon: Eric Lu - 1st Prize winner at the 2015 National Chopin Competition and 2018 Leeds Competition. MBWC.\n\nMay 17: Chopin for All free concert: 5th Prize Winner National Chopin Piano Competition. AACC.\n\nMay 18: Chopin for All free concert: 5th Prize Winner National Chopin Piano Competition. Granada.\n\nDRANOFF 2 PIANO FUSION\n\nNov. 24: Classical Classics - “Back to Beethoven”: Beethoven’s 9th Symphony in a two-piano arrangement by Franz Liszt performed by Ukrainian classical stars Olha Chipak and Oleksiy Kushnir with percussion accompaniment. The first half of the program will present classics by Liszt and Maurice Ravel. Aventura.\n\nFeb. 16: West African Beats - “One Song”: A musical journey through the African diaspora through song and dance featuring Nicole Yarling on vocals and violin, Martin Bejerano and Jim Gasior on piano, and an ensemble of South Florida’s finest performers. MBB.\n\nApril 23: Piano Slam - “Music of My Past ... Sounds of the Future”: A classical/Afropop/spoken-word mashup featuring Miami’s top teen poets and performed alongside renowned classical piano duo Jeroen van Veen and Mike Del Ferro and DJ synth player Anthony “Smurfio” Laurencio. Location TBD.\n\nMay 9: Latin 2 Pianos - “From Rio to Miami”: Classical, samba, bossa nova, choro, baiao, maracatu and jazz, the rich diversity of Brazilian music featuring pianists Thito Camargo and Phil DeGreg, who will present works by some of Brazil’s greatest composers, such as Antonio Carlos Jobim, Pixinguinha, Joao Gilberto, Hermeto Pascoal, Egberto Gismonti and Milton Nascimento. Sanctuary.\n\nFIU SCHOOL OF MUSIC\n\nOct. 5: FIU Orchestral Masterworks Opening Concert: Beethoven’s Eroica & Mozart’s Piano Concerto No. 20. FIU-Wertheim.\n\nOct. 10: FIU Wertheim School of Music Departmental Recital. FIU-Wertheim.\n\nOct. 11: FIU Wind Ensemble presents Kaleidoscope. FIU-Wertheim.\n\nOct. 12-13: Best of Broadway. FIU-Wertheim.\n\nOct. 19: FIU Choirs: A Soul’s Journey: Songs of Life, Love, and Spirit. FIU-Wertheim.\n\nOct. 20: Robert B. Dundas Voice Studio Recital. FIU-Wertheim.\n\nOct. 26: FIU Music Festival 2024: All Stars Jazz Evening! FIU-Wertheim.\n\nOct. 27: FIU Music Festival 2024: Organ Performance. FIU-Wertheim.\n\nNov. 1: FIU Music Festival 2024: Chamber Music Extravaganza! Amernet String Quartet & Guests. FIU-Wertheim.\n\nNov. 2: FIU Music Festival 2024: FIU Masterworks: Dvorak – New World & Latin America. FIU-Wertheim.\n\nNov. 3: FIU Music Festival 2024: Banyan Percussion Quartet. FIU-Wertheim.\n\nNov. 8-9: FIU Music Festival: Kings, Queens & Thieves. FIU-Wertheim.\n\nNov. 13: FIU Opera Theater presents An Evening of French Opera Arias and Scenes. FIU-Wertheim.\n\nNov. 14: FIU Student Composers Concert. Mana-Wynwood.\n\nNov. 14: FIU Jazz Vocal Ensemble Live! FIU-Wertheim.\n\nNov. 15: FIU Wind Ensemble presents Kaleidoscope. FIU-Wertheim.\n\nNov. 19: FIU Chamber Music Recital. FIU-Wertheim.\n\nNov. 20: FIU Miami GuitART Orchestra. FIU-Wertheim.\n\nNov. 23: FIU Choirs - Traveler’s Journey: A Voyage of Global Soundscapes. FIU-Wertheim.\n\nNov. 24: Vindhya Khare Diction Recital. FIU-Wertheim.\n\nNov. 25: FIU Latin Jazz Ensemble. FIU-Wertheim.\n\nNov. 26: FIU Musical Theatre Workshop Studio Showcase Concert. FIU-Wertheim.\n\nDec. 5: FIU Wertheim School of Music Departmental Recital. FIU-Wertheim.\n\nDec. 5: FIU Gospel Choir. FIU-Wertheim.\n\nDec. 6: FIU Orchestral Masterworks Holiday Concert: Duke Ellington’s Nutcracker Suite. FIU-Wertheim.\n\nJan. 18: FIU Piano Recital: Dr. Eva Polgar. FIU-Wertheim.\n\nJan. 22: 2025 XXVIII New Music Miami ISCM Festival: Opening Concert with the Amernet and Laura Schwendinger. FIU-Wertheim.\n\nJan. 25: FIU Piano Recital: Grigorios Zamparas. FIU-Wertheim.\n\nJan. 29: 2025 XXVIII New Music Miami ISCM Festival: Byrne Kozar Duo. FIU-Wertheim.\n\nJan. 30: FIU Orchestral Masterworks: Concerto Competition Winners Concert. FIU-Wertheim.\n\nFeb. 5: 2025 XXVIII New Music Miami ISCM Festival: FU Alumni Composers Concert. FIU-Wertheim.\n\nFeb. 5-6: FIU Opera Theater. FIU-Wertheim.\n\nFeb. 6: FIU Wertheim School of Music Departmental Recital. FIU-Wertheim.\n\nFeb. 7: FIU Piano Recital: Jay Hershberger. FIU-Wertheim.\n\nFeb. 8: FIU Choirs: A Day’s Journey: Songs of Sun, Sky and Shadows. FIU-Wertheim.\n\nFeb. 9: FIU Piano Alumni Recital. FIU-Wertheim.\n\nFeb. 13: Broadway in Love. FIU-Wertheim.\n\nFeb. 15-23: FIU Miami International GuitART Festival. FIU-Wertheim.\n\nFeb. 19: 2025 XXVIII New Music Miami ISCM Festival: An Evening of Music for Piano & Electronics. FIU-Wertheim.\n\nFeb. 22: Festival of Bands Culminating Concert ft. FIU Wind Ensemble. FIU-Wertheim.\n\nMarch 7-8: FIU Musical Theatre Class Showcase. FIU-Wertheim.\n\nMarch 12: 2025 XXVIII New Music Miami ISCM Festival: Chun-Hao Ku, Saxophonist. FIU-Wertheim.\n\nMarch 26: 2025 XXVIII New Music Miami ISCM Festival: Music from North and South America. FIU-Wertheim.\n\nApril 2: FIU Student Composers Concert at Wynwood. FIU-Wertheim.\n\nApril 3: Robert B. Dundas Voice Studio Recital: The Liebeslieder of Clara & Robert Schumann. FIU-Wertheim.\n\nApril 7: FIU Latin Jazz Ensemble. FIU-Wertheim.\n\nApril 8: FIU Gospel Choir. FIU-Wertheim.\n\nApril 9: 2025 XXVIII New Music Miami ISCM Festival: Jeonghyeon Joo, haegeum and Ethan Marks, trumpet. FIU-Wertheim.\n\nApril 9: FIU Wind Ensemble: Kaleidoscope. FIU-Wertheim.\n\nApril 10: FIU Wertheim School of Music Departmental Recital. FIU-Wertheim.\n\nApril 10: FIU Musical Theatre Class Showcase. FIU-Wertheim.\n\nApril 11: Arias & Ensembles from German Romantic Operas. FIU-Wertheim.\n\nApril 12: FIU Orchestral Masterworks: Beethoven, Barber and Copland. FIU-Wertheim.\n\nApril 13: Vindhya Khare Studio Diction Recital. FIU-Wertheim.\n\nApril 13: FIU Choirs: Faure Requiem with Civic Chorale of Greater Miami. FIU-Wertheim.\n\nApril 14: FIU Miami GuitART Orchestra. FIU-Wertheim.\n\nApril 15: FIU Chamber Music Recital: Strings & Piano Studios. FIU-Wertheim.\n\nApril 16: FIU Jazz Vocal Ensemble Live! FIU-Wertheim.\n\nApril 16: 2025 XXVIII New Music Miami ISCM Festival Closing Concert. FIU-Wertheim.\n\nApril 18-19: FIU Musical Theatre presents Animal Farm. FIU-Wertheim.\n\nFLORIDA GRAND OPERA\n\nNov. 16, 17 and 19: The Magic Flute (Die Zauberflote) by Wolfgang Amadeus Mozart. Arsht.\n\nDec. 5 and 7: The Magic Flute (Die Zauberflote) by Wolfgang Amadeus Mozart. BCPA.\n\nFeb. 1, 2 and 4: The Elixir of Love (L’elisir d’amore) by Gaetano Donizetti. Arsht.\n\nFeb. 13 and 15: The Elixir of Love (L’elisir d’amore) by Gaetano Donizetti. BCPA.\n\nApril 12, 13 and 15: Carmen by Georges Bizet. Arsht.\n\nApril 24 and 26: Carmen by Georges Bizet. BCPA.\n\nFLORIDA YOUTH ORCHESTRA\n\nNov. 17: Principal Orchestra, Symphony Orchestra, Flute Choir. Bailey.\n\nDec. 15: Repertory Strings, Chamber Strings, Flute Choir. Sunrise.\n\nDec. 16: Recital: iPlay, Play-2, Alpha Strings, Silver Strings. NSU.\n\nFeb. 16: ParkFest Love & Music Concert: Principal Orchestra, Flute Choir. Heritage.\n\nMarch 16: Spotlight Concert: Symphony Orchestra, Repertory Strings, Chamber Strings. CSCA.\n\nApril 6: Tentative: ParkFest Love & Music Concert: Symphony Orchestra, Flute Choir. Venue TBA.\n\nMay 5: Recital: iPlay, Play-2, Alpha Strings, Silver Strings. NSU.\n\nMay 18: Celebration Concert & Banquet: Principal Orchestra, Symphony Orchestra, Repertory Strings, Chamber Strings, Flute Choir. Dodge.\n\nFROST MUSIC LIVE\n\nSept. 22: Frost Symphonic Winds. UM-Gusman.\n\nSept. 26: Seraph Brass. Newman.\n\nSept. 27: Jiaman Li, Doctoral Piano (Classical) Recital. Newman.\n\nSept. 28: CONFLUENCES | Laura Lambuley & Quintet. Weeks.\n\nSept. 29: Boris Berman – Piano Recital. UM-Gusman.\n\nOct. 4: Choralcopia - Frost Bella Voce, Symphonic Choir, Jazz Vocal I, Opera Theater and Biscaydence. UM-Gusman.\n\nOct. 5: I Shall Express Myself As I Am – Ensemble Ibis, the music of Chen Yi. Newman.\n\nOct. 6: Contrasts – Lindsay Kesselman, soprano Chen Yi, Frost Wind Ensemble. UM-Gusman.\n\nOct. 8: Sean Jones & Frost Jazz Orchestra. UM-Gusman.\n\nOct. 10: Frost Extensions & Jazz Vocal 1 & 2. UM-Gusman.\n\nOct. 11: Kamil Pacholec – Doctoral Piano (Classical) Recital. Newman.\n\nOct. 17: BACH2BACH2BACH - Frost Chamber Players. Newman.\n\nOct. 19: Jelani Bauman – Doctoral Jazz Trumpet Recital. Weeks.\n\nOct. 19: Trails & Trials – Frost Symphonic Orchestra. UM-Gusman.\n\nOct. 20: South Florida Horn Bash. Knight.\n\nOct. 20: Frost Symphonic Winds. UM-Gusman.\n\nOct. 21: Three Centuries of Serenades for Flute, Violin & Viola. Newman.\n\nOct. 22: Frost Emerging Composers Concert. Newman.\n\nOct. 23: Halle Puckett - Doctoral Piano (Classical) Recital. Newman.\n\nOct. 24: 7by7by7. UM-Gusman.\n\nOct. 24: Congcong Wang – Doctoral Voice (Classical) Recital. Newman.\n\nOct. 25: Hao Yang – Guitar Recital. Newman.\n\nOct. 29: Chamber Singers Recital. Newman.\n\nOct. 29: Etienne Charles, director - Frost Studio Jazz Band. UM-Gusman.\n\nOct. 30: Viola Studio Recital - Jodi Levitz, director. Newman.\n\nNov. 1: Sydney Guillaume & Frost Chorale. UM-Gusman.\n\nNov. 1: Sarah Vaughan – A Sassy Centennial. Arsht.\n\nNov. 2: Yingxi Liu – Doctoral Voice (Classical) Recital. Newman.\n\nNov. 3: Voyages - Frost Wind Ensemble. UM-Gusman.\n\nNov. 3: Jonah Schertz - Senior Percussion (Classical) Recital. Newman.\n\nNov. 4: Frost Saxophone Quartets. Newman.\n\nNov. 5: Frost Jazz Orchestra. UM-Gusman.\n\nNov. 7: Frost Electroacoustic Ensemble. Weeks.\n\nNov. 7: Graduate Conductors’ Showcase - Frost Repertory Orchestra. UM-Gusman.\n\nNov. 8: Emma Beers – Senior Voice (Classical) Recital. Newman.\n\nNov. 9: Frost Chamber Music Showcase Marathon I. Newman.\n\nNov. 9: The Music of Rogers and Hammerstein II - Frost Musical Theater Ensemble. UM-Gusman.\n\nNov. 10: Matias Cuevas - Master’s Classical Piano Recital. Newman.\n\nNov. 10: Jianlin Sha, Doctoral Trombone (Classical) Recital. Newman.\n\nNov. 11: Frost Trombone Choir. Newman.\n\nNov. 12: Asher Lurie, Senior Composition Recital. Newman.\n\nNov. 12: Jazz Vocal Ensembles — Frost Extensions & Jazz Vocal 1 & 2. UM-Gusman.\n\nNov. 13: Eye on American Opera: 1900-2024 - Frost Opera Theater. Weeks.\n\nNov. 13: Frost Flute Ensemble. Newman.\n\nNov. 14: Frost Chamber Music Showcase I. Newman.\n\nNov. 15: Swingin’ for the Holidays! — Jazz Holiday Concert. UM-Gusman.\n\nNov. 16: George Bowerman - Doctoral Piano (Classical) Recital. Weeks.\n\nNov. 16: Americana — Frost Symphony Orchestra. UM-Gusman.\n\nNov. 17: Kevin Knowles - Doctoral Piano (Classical) Recital. Newman.\n\nNov. 17: Frost Symphonic Winds. UM-Gusman.\n\nNov. 17: Ben Dunham – Senior Composition Recital. Newman.\n\nNov. 18: Frost Saxophone Ensemble. UM-Gusman.\n\nNov. 20: Junhao Li - Doctoral Viola Recital. Newman.\n\nNov. 20: XJB Big Band. Weeks.\n\nNov. 21: Frost Chamber Singers Recital. Newman.\n\nNov. 21: Sophia Lin - Doctoral Piano (Classical) Recital. Newman.\n\nNov. 21: Oscar Micheaux’s ‘Within Our Gates’ - Wycliffe Gordon and the Frost Studio Jazz Band. UM-Gusman.\n\nNov. 22: 2026 Stamps String Quartet Fall Recital. Newman.\n\nNov. 23: Ruyue Tan - Doctoral Piano (Classical) Recital. Newman.\n\nNov. 23: Hongxi Li, Doctoral Piano (Classical) Recital. Newman.\n\nJan. 18: Let’s Go to Brazil! — Family Concert. UM-Gusman.\n\nJan. 23: The Music of Count Basie - The Frost Jazz Orchestra. UM-Gusman.\n\nJan. 25: 42nd Annual Frost Honor Band Concert. UM-Gusman.\n\nJan. 31: Scott Robinson & The Henry Mancini Institute Orchestra. UM-Gusman.\n\nFeb. 1: Schubertiade. Newman.\n\nFeb. 2: Beasts and Broomsticks – Music for Contra and Bassoon. Newman.\n\nFeb. 4: The Great Migration - Frost Studio Jazz Band. UM-Gusman.\n\nFeb. 7: Pas de Trois – Art Song Recital. Newman.\n\nFeb. 8: Eclectics — Frost Symphony Orchestra. UM-Gusman.\n\nFeb. 9: Frost Symphonic Winds. UM-Gusman.\n\nFeb. 10: Dover Quartet – Chamber Music Series. Newman.\n\nFeb. 14: New York Voices - Frost Jazz Vocal Ensembles. UM-Gusman.\n\nFeb. 15: Classical Guitar Night – Faculty Recital. Newman.\n\nFeb. 16: Choral Collage Frost Chorale, Bella Voce, Chamber Singers & Symphonic Choir. UM-Gusman.\n\nFeb. 18: The Frost Jazz Orchestra & The Wayne Shorter Ensemble, featuring Miho Hazama. UM-Gusman.\n\nFeb. 19: Frost Percussion Group. Newman.\n\nFeb. 21: Sonatas – Faculty Recital. Newman.\n\nGREATER MIAMI SYMPHONIC BAND\n\nOct. 13: Greater Miami Symphonic Band. UM-Gusman.\n\nNov. 3: Greater Miami Symphonic Band. Pinecrest.\n\nDec. 8: Greater Miami Symphonic Band. Pinecrest.\n\nDec. 15: Greater Miami Symphonic Band. UM-Gusman.\n\nFeb. 23: Greater Miami Symphonic Band. Pinecrest.\n\nMarch 16: Greater Miami Symphonic Band. UM-Gusman.\n\nApril 27: 16th Annual Chamber Concert. KUMC.\n\nMay 18: Greater Miami Symphonic Band. UM-Gusman.\n\nKRAVIS CENTER FOR THE PERFORMING ARTS\n\nNov. 19: Royal Concertgebouw Orchestra: Klaus Makela, Music Director Designate; Lisa Batiashvili, violin. Program: Prokofiev, Violin Concerto No. 2 in G Minor, Op. 63; Rachmaninov, Symphony No. 2 in E Minor, Op. 27. KRAVIS.\n\nDec. 15: Curtis Symphony Orchestra: Teddy Abrams, conductor; Ray Chen, violin. Program: Barber, Violin Concerto, Op. 14. KRAVIS.\n\nJan. 5: Renee Fleming, soprano. Program: Voices of Nature. KRAVIS.\n\nJan. 17: Chicago Symphony Orchestra: Riccardo Muti, Music Director. Program: Bellini, Overture from Norma; Schubert, Symphony No. 8 in B Minor, D 759 “Unfinished”; Tchaikovsky, Symphony No. 4 in F Minor, Op. 36. KRAVIS.\n\nJan. 27: The Cleveland Orchestra: Kachun Wong, conductor; Sayaka Shoji, violin. Program: Beethoven, Violin Concerto in D Major, Op. 61; Mussorgsky, Pictures at an Exhibition (orch. Ravel). KRAVIS.\n\nFeb. 24: Daniel Hope and the Polish Chamber Orchestra of Sinfonia Varsovia: Daniel Hope, Music Director. Program: Journey to Mozart. KRAVIS.\n\nMarch 1: London Symphony Orchestra: Sir Antonio Pappano, Chief Conductor; Janine Jansen, violin. Program: Walker, Sinfonia No. 5, “Visions”; Bernstein, Serenade, after Plato’s Symposium; Walton, Symphony No. 1 in B-flat Major. KRAVIS.\n\nMarch 10: An Evening with Itzhak Perlman and Rohan De Silva: Itzhak Perlman, violin; Rohan De Silva, piano. KRAVIS.\n\nMarch 20: Israel Philharmonic Orchestra: Lahav Shani, Music Director. Program: Mendelssohn, Symphony No. 3 in A Minor, Op. 56; Tchaikovsky, Symphony No. 5 in E Minor, Op. 64. KRAVIS.\n\nMarch 23: National Symphony Orchestra: Gianandrea Noseda, Music Director; Hilary Hahn, violin. Program: Carlos Simon, Four Black American Dances; Korngold, Violin Concerto in D Major, Op. 35; Beethoven, Symphony No. 5 in C Minor, Op. 67. KRAVIS.\n\nApril 18: New World Symphony: Stephane Deneve, Music Director; Sheku Kanneh-Mason, cello. Program: Shostakovich, Cello Concerto No. 1 in E-flat Major, Op. 107. KRAVIS.\n\nLYNN UNIVERSITY’S CONSERVATORY OF MUSIC\n\nSept. 23: Piano Recital and Master Class with Chen Liang ’16. Amarnick.\n\nSept. 27: Piano Master Class with Marita Rodriguez. Amarnick.\n\nSept. 28-29: Philharmonia No. 1. Lynn-Wold.\n\nOct. 6: 2023 Lynn Concerto Competition, Final Round. Amarnick.\n\nOct. 7: Piano Recital and Master Class with Norman Krieger. Amarnick.\n\nOct. 14: Violin Master Class with Arnaud Sussman. Amarnick.\n\nOct. 29: Violin Master Class with Andres Cardenes. Amarnick.\n\nNov. 3: Time Travel from the Keyboard: From the Studio of Lisa Leonard. Lynn-Wold.\n\nNov. 9-10: Philharmonia No. 2. Lynn-Wold.\n\nNov. 16-17: Mendelssohn’s “Elijah” with Master Chorale of South Florida. Lynn-Wold.\n\nNov. 19: Bassoon Master Class with Gustavo Nunez. Amarnick.\n\nDec. 5: Faculty Masters Concert No. 1. Amarnick.\n\nDec. 8: Gingerbread Holiday Concert. Lynn-Wold.\n\nDec. 12: 2024 Lyric Chamber Music Competition, Final Round. Amarnick.\n\nJan. 12: Piano Passion: From the Studio of Roberta Rust. Lynn-Wold.\n\nJan. 17: Clarinet Master Class with Stephen Williamson. Amarnick.\n\nJan. 18-19: Philharmonia No. 3. Lynn-Wold.\n\nJan. 25: John Oliveira String Competition Final Round. Amarnick.\n\nJan. 26: John Oliveira Winner’s Concert. Amarnick.\n\nJan. 30: Pianist Lisa Leonard in Recital. Amarnick.\n\nFeb. 3: Piano Recital and Master Class with Victor Rosenbaum. Amarnick.\n\nFeb. 8, 9, 13, 14 and 16: 19th Annual New Music Festival. Lynn-Wold.\n\nFeb. 8-9: Philharmonia No. 4. Lynn-Wold.\n\nMarch 11: Violin Master Class with Andres Cardenes. Amarnick.\n\nMarch 16: Pianist Charlotte Hu in Recital. Amarnick.\n\nMarch 20: Faculty Masters Concert No. 2. Amarnick.\n\nMarch 22-23: Philharmonia No. 5. Lynn-Wold.\n\nMarch 27: Andres Cardenes Violin Recital. Amarnick.\n\nMarch 30: Woodwind Department Recital. Amarnick.\n\nApril 9: Palm Beach Opera Young Artists. Amarnick.\n\nMARTHA/MARY CONCERT SERIES\n\nOct. 20: Brazilian Festival: Thito Camargo Trio & Beatriz Malnic with Adam Lord. CCCC.\n\nDec. 6: Spanish Brass Holiday Concert. CCCC.\n\nFeb. 16: Affinitas Trio: Featuring violinist Gary Levinson, pianist Paul Posnak & cellist Wendy Sutter. CCCC.\n\nApril 27: Great Jazz featuring Jazz Vocal Ensembles of Frost School of Music with headliner TBA. CCCC.\n\nNEW WORLD SCHOOL OF THE ARTS\n\nSept. 23: Wind Ensemble Pops Concert. Chapman.\n\nOct. 15: Opera Scenes. Koubek.\n\nOct. 21: High School Voice Concert. MDC-Wolfson.\n\nOct. 28: High School Instrumental Ensembles. Chapman.\n\nOct. 31: High School Jazz Combos Concert. MDC-Wolfson.\n\nNov. 8: Voice Concert Side-by-Side. MDC-Wolfson.\n\nDec. 2: College Chamber Orchestra Concert. Chapman.\n\nDec. 3: College Piano, Chamber and Composition Recital. MDC-Wolfson.\n\nDec. 9:  Concerto Competition Winners’ Concert. Lyric.\n\nDec. 12:  High School Choir Holiday Concert. Trinity.\n\nDec. 17: High School Wind Ensemble. Chapman.\n\nJan. 13: NWSA Music Faculty Recital. MDC-Wolfson.\n\nJan. 25: Singers’ Sanctuary Symposium Concert. Batten.\n\nFeb. 8-9:  Opera Production – Die Fledermaus. Lehman.\n\nFeb. 18: High School Wind Ensemble. Chapman.\n\nMarch 4: High School Voice Concert. MDC-Wolfson.\n\nMarch 14: Rising Stars Performance. Arsht.\n\nMarch 18: NWSA Symphony Orchestra Concert. Arsht.\n\nApril 17: High School Jazz Combos Concert. MDC-Wolfson.\n\nApril 21: College Piano, Chamber and Composition Recital. MDC-Wolfson.\n\nApril 24: NWSA/MDC Orchestra Side-By-Side. Batten.\n\nMay 19: High School Choir Concert. MDC-Wolfson.\n\nMay 20: High School Instrumental Ensembles. Chapman.\n\nNEW WORLD SYMPHONY\n\nSept. 28:  Preseason Orchestra Concert: Stephanie Childress, conductor; Stella Chen, violin; Molly Turner, conductor. Program: Beethoven - Leonore Overture No. 3; Barber - Violin Concerto; Mendelssohn - Symphony No. 4, “Italian.” NWC.\n\nOct. 5-6:  Season Opener: Stephane Deneve Conducts MTT and Shostakovich. Program: Michael Tilson Thomas: From the Diary of Anne Frank; Dmitri Shostakovich: Symphony No. 5. NWC.\n\nOct. 13:  Chamber Music – Haydn + Borodin: Titus Underwood, oboe. Program: Luigi Boccherini - Oboe Quintet; Lee Hyla: Dream of Innocent III; Viet Cuong: Extra Fancy; Franz Joseph Haydn: Divertimento, “St. Anthony Chorale”; Alexander Borodin: String Sextet. NWC.\n\nOct. 19-20:  Deneve: The Seven Deadly Sins: Stephane Deneve, conductor; Yuval Sharon, director; Danielle De Niese, soprano. Program: Viktor Ullmann - The Kaiser of Atlantis;  Kurt Weill - The Seven Deadly Sins. NWC.\n\nOct. 26: The Planets + Rachmaninoff: Xian Zhang, conductor; Alexander Malofeev, piano; Voices of the Master Chorale of South Florida. Program: Richard Wagner - Prelude to Act I from Tristan and Isolde; Sergei Rachmaninoff - Rhapsody on a Theme of Paganini; Gustav Holst - The Planets. Arsht.\n\nNov. 3: Concert for Kids: Dia de los Muertos. Molly Turner, conductor. NWC.\n\nNov. 9-10: Veterans Day Concert – A WWII Journey. Lidiya Yankovskaya, conductor; Emily Magee, soprano; James Holland, historian. Program: Aaron Copland: Fanfare for the Common Man; Pavel Haas: Mvt. II from Symphony No. 2; Dmitri Shostakovich: Mvt. IV from Symphony No. 7; William Grant Still: In Memoriam; John Williams: Hymn to the Fallen from Saving Private Ryan; Richard Strauss: Four Last Songs. NWC.\n\nNov. 17: Chamber Music - Crider Sings Ravel + Copland. Amanda Crider, mezzo-soprano. Program: Aaron Copland - “As It Fell Upon a Day”; Jonathan Bailey Holland - Mobius; Maurice Delage - Quatre poemes hindous; Albert Roussel - Serenade for Flute, Harp and Strings; Maurice Ravel - Trois poemes de Mallarme; Sergei Rachmaninoff - Trio elegiaque No. 1. NWC.\n\nNov. 23-24: Mozart + Bach. Shunske Sato, violin and leader. Program: Wolfgang Amadeus Mozart - Symphony No. 1; Mozart (arr. Sato) - Keyboard Concerto in D; Johann Christian Bach - Symphony in G minor; Johann Sebastian Bach - Concerto for Two Violins; Johann Sebastian Bach (arr. Mozart) - Fugue; Mozart - Symphony No. 41, “Jupiter.” NWC.\n\nDec. 14-15: Kavakos: Mozart and Brahms. Leonidas Kavakos, violin and conductor; Molly Turner, conductor. Program: Louise Farrenc - Overture No. 1; Wolfgang Amadeus Mozart - Violin Concerto No. 4; Johannes Brahms - Symphony No. 4. NWC.\n\nDec. 21: Sounds of the Season Holiday Concert: Molly Turner, conductor. NWC.\n\nDec. 22: Chamber Music: McDermott, Messiaen and Mozart. Anne-Marie McDermott, piano; Musicians of the New World Symphony. Program: Eotvos - The King in Yellow; Mozart - Piano Quintet in E-flat major; Messiaen - Quartet for the End of Time. NWC.\n\nJan. 11: Piazzolla’s Tango. Paolo Bortolameolli, conductor; Julien Labro, bandoneon. Arsht.\n\nJan. 13: Solo Spotlight. NWC.\n\nJan. 18-19: Rachmaninoff’s Symphonic Dances. Anja Bihlmeier, conductor; Molly Turner, conductor; Master Chorale of South Florida. Program: Korngold - Main Title from Between Two Worlds; Waxman - Elegy for Strings; Orbon - Pavana from Tres Versiones Sinfonica; Schoenberg - A Survivor from Warsaw; Rachmaninoff - Symphonic Dances. NWC.\n\nJan. 26: Chamber Music – The Chamber Cello. Oliver Herbert, cello; Musicians of the New World Symphony. Program: Garcia - prohibido; Yi - Suite for Cello and Chamber Winds; Desenne - Pizziquitiplas; Brahms : Piano Trio No. 1. NWC.\n\nFeb. 8-9: I Dream a World: Transitions and Trailblazers. Jeri Lynne Johnson, conductor. Program: Still - Festive Overture; Perry - Stabat Mater; William Dawson - Negro Folk Symphony. NWC.\n\nFeb. 10: Solo Spotlight. NWC.\n\nFeb. 16: Chamber Music: Dvorak + Ravel. Amihai Grosz, viola; Musicians of the New World Symphony. Program: Bloch - Concertino for Flute, Viola and Strings; Takemitsu - Signals from Heaven; Ravel - String Quartet; Dvorak - Piano Trio No. 3. NWC.\n\nMarch 1-2: Deneve: Music in (Techni)Color. Stephane Deneve, conductor. Program: Ravel - Mother Goose Suite; Clyne - PALETTE; Mussorgsky - Pictures at an Exhibition. NWC.\n\nMarch 8-9: Deneve: Davone Tines’ Mass. Stephane Deneve, conductor; Davone Tines, baritone. Program: J.S. Bach - Brandenburg Concerto No. 4; Abels - Delights and Dances; Tines - Recital No. 1: MASS. NWC.\n\nMarch 15: Deneve: Britten’s War Requiem. Stephane Deneve, conductor; Christine Goerke, soprano; Ian Bostridge, tenor; Roderick Williams, baritone; Florida Singing Sons; Girl Choir of South Florida; Master Chorale of South Florida. Program: Britten - War Requiem. NWC.\n\nMarch 17: Solo Spotlight. NWC.\n\nMarch 23: Concert for Kids: Nature Walk. Molly Turner, conductor. NWC.\n\nMarch 29-30: MTT, Bronfman and Beethoven. Michael Tilson Thomas, conductor; Yefim Bronfman, piano; Susanna Phillips, soprano. Program: Schubert - “Der Hirt auf dem Felsen”; Schumann - Piano Concerto; Beethoven - “Ah! Perfido”; Beethoven - Symphony No. 5. NWC.\n\nApril 7: Solo Spotlight. NWC.\n\nApril 12-13: A Sibelius Journey. Dalia Stasevska, conductor. Program: Sibelius - In memoriam; Sibelius - Canzonetta; Sibelius - The Dryad; Sibelius - Night Ride and Sunrise; Sibelius - Symphony No. 4. NWC.\n\nApril 19: Deneve: Symphonie Fantastique. Stephane Deneve, conductor; Sheku Kanneh-Mason, cello. Program: Williams - Suite from The Book Thief; Shostakovich - Cello Concerto No. 1; Berlioz - Symphonie Fantastique. NWC.\n\nMay 3-4: Season Finale with Gil Shaham. Edward Gardner, conductor; Gil Shaham, violin; Molly Turner, conductor. Program: Musgrave - Song of the Enchanter; Dvorak - Violin Concerto; Bartok - Concerto for Orchestra. NWC.\n\nNU DECO ENSEMBLE\n\nOct. 5-6: Nu Deco at the Colony Theatre ft. Alfredo Rodriguez. Colony.\n\nOct. 25-26: Nu Deco Lounge at The Citadel I. Citadel.\n\nNov. 16: Nu Deco at the Bandshell I. MBB.\n\nDec. 13: Nu Deco at the Adrienne Arsht Center I. Arsht.\n\nJan. 18: Nu Deco at the Bandshell II. MBB.\n\nFeb. 7-8: Nu Deco Lounge at The Citadel II. Citadel.\n\nMarch 7-8: Nu Deco Lounge at The Citadel III. Citadel.\n\nMarch 29: Nu Deco NXT Spring Concert. Moss.\n\nApril 26: Nu Deco at the Adrienne Arsht Center II. Arsht.\n\nMay 16-17: Nu Deco at the Bandshell III. MBB.\n\nORCHESTRA MIAMI\n\nOct. 20: Family Fun Series: Rumplestiltskin and other spooky musical stories. Pinecrest.\n\nNov. 23: Puccini’s Legacy. Temple.\n\nDec. 31: Orchestra Miami’s Free New Year’s Eve Celebration - On the beach between 21st & 22nd Streets in Miami Beach.\n\nJan. 12: Family Fun Series: The Bremen Town Musicians - an Opera for Kids. Pinecrest.\n\nFeb. 16: Fiddling Around. Pinecrest.\n\nMarch 1: Beethoven on the Beach – Free Outdoor Concerts. MBB.\n\nMarch 2: Beethoven on the Beach – Free Outdoor Concerts. Pinecrest.\n\nMarch 3: Beethoven on the Beach – Free Outdoor Concerts. Gateway.\n\nMarch 16: Family Fun Series: Fun Fables & Musical Fairy Tales. Pinecrest.\n\nMarch 30: Too Hot to Handel. Moss.\n\nPALM BEACH SYMPHONY\n\nOct. 26: Dale A. McNulty Children’s Concert Series. World premiere of Cinderella and the Orchestra conducted by Gerard Schwarz. EISSEY.\n\nNov. 10: Masterworks Series I: Julian Schwarz, cello; conducted by Gerard Schwarz. Program: Antonin Dvorak: Cello Concerto in B Minor, Op. 104; Ellen Taaffe Zwilich: Celebration for Orchestra; Modest Mussorgsky, orch. Maurice Ravel: Pictures at an Exhibition. KRAVIS.\n\nDec. 10: Masterworks Series II: Leonidas Kavakos, violin; conducted by Gerard Schwarz. Program: Johannes Brahms: Violin Concerto in D Major, Op. 77; Christopher Theofanidis: Rainbow Body; Antonin Dvorak: Symphony No. 7 in D Minor, Op. 70. KRAVIS.\n\nJan. 13: Masterworks Series III: Jean-Yves Thibaudet, piano; conducted by Gerard Schwarz. Program: Maurice Ravel: Piano Concerto in G Major; Jennifer Higdon: blue cathedral; Pyotr Ilyich Tchaikovsky: Symphony No. 6 in B Minor, Passionate Symphony. KRAVIS.\n\nFeb. 6: Masterworks Series IV: Gil Shaham, violin; conducted by Gerard Schwarz. Program: Ludwig van Beethoven: Violin Concerto in D Major, Op. 61; Gustav Mahler: Symphony No. 1 in D Major Titan. KRAVIS.\n\nMarch 2: Masterworks Series V: Garrick Ohlsson, piano; conducted by Gerard Schwarz. Program: Sergei Rachmaninoff: Piano Concerto No. 2 in C minor, Op. 18; Paul Creston: Invocation and Dance, Op. 58; Howard Hanson: Symphony No. 2, Op. 30 - Romantic. KRAVIS.\n\nApril 8: Masterworks Series VI: Anne-Marie McDermott, piano; conducted by Gerard Schwarz. Program: Ludwig van Beethoven: Piano Concerto No. 1 in C Major, Op. 15; William Grant Still: Threnody: In Memory of Jean Sibelius; Claude Debussy: La mer; Maurice Ravel: Daphnis et Chloe Suite No. 2. KRAVIS.\n\nMay 19: Community Concert: Kevin Kenner, piano; conducted by Gerard Schwarz. Program: Fryderyk Franciszek Chopin: Piano Concerto No. 2 in F Minor, Op. 21; Johannes Brahms: Akademische Festouverture, Op. 80 - Academic Festival Overture; Ludwig van Beethoven: Symphony No. 5 in C Minor, Op. 67. KRAVIS.\n\nSANCTUARY OF THE ARTS\n\nSept. 28-29: Alhambra Orchestra Hispanic Heritage - Concert Celebration. Sanctuary.\n\nOct. 5: Havana Nocturne - Aymee Nuviola. Sanctuary.\n\nOct. 12: Fine Arts Miami Evening Serenade. Sanctuary.\n\nOct. 29-31: Miami Children’s Theatre Hadestown. Sanctuary.\n\nNov. 1: Venice Baroque Orchestra. Sanctuary.\n\nNov. 2-5: Miami Children’s Theatre Hadestown. Sanctuary.\n\nNov. 7: Miami Film Festival Event. Sanctuary.\n\nNov. 8-10: Strommar Concert Series. Sanctuary.\n\nNov. 11-12: Miami Children’s Theatre Frozen Kids. Sanctuary.\n\nNov. 16: Ruckus - Strawberry Fields. Sanctuary.\n\nDec. 3: Coral Gables State of the Arts. Sanctuary.\n\nDec. 5: Cleveland Orchestra. Sanctuary.\n\nDec. 7: New World Symphony Wallcast. Sanctuary.\n\nDec. 13: SOA Classical Holiday Concert. Sanctuary.\n\nDec. 14: SOA Duke Ellington Jazz Nutcracker. Sanctuary.\n\nDec. 15: The Opera Atellier El Abrazo. Sanctuary.\n\nDec. 20: Syncopate Dance Collective Holiday Show. Sanctuary.\n\nDec. 21: Dance NOW! Miami CLARA. Sanctuary.\n\nSERAPHIC FIRE\n\nOct. 10: A Brief History of Western Music. St. Sophia.\n\nOct. 11: A Brief History of Western Music. Flower.\n\nOct. 12: A Brief History of Western Music. All Saints.\n\nOct. 13: A Brief History of Western Music. Kravis.\n\nNov. 7: Contemporary: Jewish Voices. Bet Shira.\n\nNov. 8: Contemporary: Jewish Voices. All Saints.\n\nNov. 9: Contemporary: Jewish Voices. Beth Sholom.\n\nDec. 7: A Seraphic Fire Christmas. St. Sophia.\n\nDec. 11: A Seraphic Fire Christmas. Kravis.\n\nDec. 13: A Seraphic Fire Christmas. Flower.\n\nDec. 14: A Seraphic Fire Christmas. Sanctuary.\n\nDec. 15: A Seraphic Fire Christmas. Moss.\n\nJan. 16: Renaissance: The Capilla Flamenca. St. Gregory’s.\n\nJan. 17: Renaissance: The Capilla Flamenca. Flower.\n\nJan. 18: Renaissance: The Capilla Flamenca. All Saints.\n\nFeb. 27: The Enlightenment Festival: Romantic – Schumann & Mendelssohn. St. Sophia.\n\nFeb. 28: The Enlightenment Festival: Romantic – Schumann & Mendelssohn. St. Philip’s.\n\nMarch 1: The Enlightenment Festival: Romantic – Schumann & Mendelssohn. All Saints.\n\nMarch 2: The Enlightenment Festival: Romantic – Schumann & Mendelssohn. St. Gregory’s.\n\nMarch 7: The Enlightenment Festival: Classical - Martines, Mozart & Haydn. Flower.\n\nMarch 8: The Enlightenment Festival: Classical - Martines, Mozart & Haydn. All Saints.\n\nMarch 9: The Enlightenment Festival: Classical - Martines, Mozart & Haydn. MBCC.\n\nApril 10: Baroque: Angels Behind the Walls. St. Gregory’s.\n\nApril 11: Baroque: Angels Behind the Walls. Flower.\n\nApril 12: Baroque: Angels Behind the Walls. All Saints.\n\nSOUTH FLORIDA PRIDE CONCERT BAND\n\nNov. 9: An Evening with Lea DeLaria. BCPA.\n\nFeb. 23: Season 14 of the Pride Youth Band. BCPA.\n\nMay 10: Heroes and Villains. BCPA.\n\nSOUTH FLORIDA SYMPHONY ORCHESTRA\n\nNov. 12: Masterworks I – Gershwin, Prokofiev, Elgar: Gershwin: 100 Years of Rhapsody in Blue featuring Benjamin Hochman, piano; Prokofiev: The Love for Three Oranges Suite (SFSO premiere); Elgar: Symphony No. 1. Parker.\n\nNov. 16: Masterworks I – Gershwin, Prokofiev, Elgar: Gershwin: 100 Years of Rhapsody in Blue featuring Benjamin Hochman, piano; Prokofiev: The Love for Three Oranges Suite (SFSO premiere); Elgar: Symphony No. 1. NWC.\n\nDec. 7: Handel’s Messiah and Holiday Pops with guest vocalists and the South Florida Symphony Chorus. Parker.\n\nDec. 8: Handel’s Messiah and Holiday Pops with guest vocalists and the South Florida Symphony Chorus. Parker.\n\nJan. 14: Masterworks II – Bernstein’s Candide: Semi-staged concert version played out with the orchestra, a dynamic cast of actor-vocalists, minimal sets and costumes and a chorus performing all together onstage. NWC.\n\nJan. 16: Masterworks II – Bernstein’s Candide: Semi-staged concert version played out with the orchestra, a dynamic cast of actor-vocalists, minimal sets and costumes and a chorus performing all together onstage (SFSO Gala Evening). BCPA.\n\nFeb. 12: Masterworks III – J. Strauss, II; Berlioz; R. Strauss: J. Strauss, II - The Blue Danube (SFSO Premiere); R. Strauss: Four Last Songs (SFSO Premiere); Berlioz: King Lear Overture (SFSO Premiere); R. Strauss: Don Juan. Parker.\n\nFeb. 15: Masterworks III – J. Strauss, II; Berlioz; R. Strauss: J. Strauss, II - The Blue Danube (SFSO Premiere); R. Strauss: Four Last Songs (SFSO Premiere); Berlioz: King Lear Overture (SFSO Premiere); R. Strauss: Don Juan. NWC.\n\nMarch 11: Masterworks IV – Mozart’s Requiem with special guest vocalists and the South Florida Symphony Chorus (SFSO Premiere). NWC.\n\nMarch 12: Masterworks IV – Mozart’s Requiem with special guest vocalists and the South Florida Symphony Chorus (SFSO Premiere). Parker.\n\nApril 9: Masterworks V – Prokofiev, Bruckner: Prokofiev: Piano Concerto No. 3 featuring Catherine Lan, piano; Bruckner: Symphony No. 4, “Romantic.” Parker.\n\nApril 10: Masterworks V – Prokofiev, Bruckner: Prokofiev: Piano Concerto No. 3 featuring Catherine Lan, piano; Bruckner: Symphony No. 4, “Romantic.” Parker.", "content_scrape_timestamp": "2025-02-20T10:04:39.789774+00:00", "id": "7b391736-79a5-4087-ad9b-2cc16f633a3a", "metadata": {"relevance_check": {"is_relevant": false, "reason": "The article is a guide to classical music events in South Florida and does not mention Guantanamo Bay or related issues. Therefore, it is not relevant to the specified topics. "}}, "metadata_extraction_timestamp": "2025-03-13T11:44:01.743721"}
